export const AVATARS = [
  "🦁", "🐯", "🐺", "🦊", "🐸", "🐧", "🦅", "🐠", "🦄", "🐲", "🤖", "👽",
];

export const PCOLORS = ["#ff6b35", "#00c9a7", "#ff4d8d", "#4d9fff"];

export const SNAKES = { 99: 21, 87: 24, 62: 19, 54: 34, 46: 5, 92: 73, 75: 32 };

export const LADDERS = { 4: 56, 13: 76, 20: 38, 28: 84, 40: 59, 51: 67, 63: 81, 71: 91 };

export const DIE_FACES = ["⚀", "⚁", "⚂", "⚃", "⚄", "⚅"];

export const TRIVIA = [
  { img: "א", opts: ["כלב 🐶", "אריה 🦁", "סוס 🐴", "פיל 🐘"],          ans: "אריה 🦁" },
  { img: "ב", opts: ["ברבור 🦢", "חתול 🐱", "נחש 🐍", "עכבר 🐭"],        ans: "ברבור 🦢" },
  { img: "ג", opts: ["אריה 🦁", "גמל 🐪", "טווס 🦚", "תוכי 🦜"],         ans: "גמל 🐪" },
  { img: "ד", opts: ["קוף 🐒", "יונה 🕊️", "דב 🐻", "זברה 🦓"],           ans: "דב 🐻" },
  { img: "ה", opts: ["גמל 🐪", "היפופוטם 🦛", "לטאה 🦎", "צב 🐢"],       ans: "היפופוטם 🦛" },
  { img: "ז", opts: ["פיל 🐘", "זברה 🦓", "חתול 🐱", "ברבור 🦢"],        ans: "זברה 🦓" },
  { img: "ח", opts: ["דב 🐻", "חתול 🐱", "נחש 🐍", "קוף 🐒"],            ans: "חתול 🐱" },
  { img: "ט", opts: ["טווס 🦚", "אריה 🦁", "סוס 🐴", "גמל 🐪"],          ans: "טווס 🦚" },
  { img: "י", opts: ["ברבור 🦢", "יונה 🕊️", "עכבר 🐭", "כלב 🐶"],        ans: "יונה 🕊️" },
  { img: "כ", opts: ["פיל 🐘", "כלב 🐶", "תוכי 🦜", "זברה 🦓"],          ans: "כלב 🐶" },
  { img: "ל", opts: ["חתול 🐱", "לטאה 🦎", "דב 🐻", "טווס 🦚"],          ans: "לטאה 🦎" },
  { img: "נ", opts: ["אריה 🦁", "כלב 🐶", "לטאה 🦎", "נחש 🐍"],          ans: "נחש 🐍" },
  { img: "ס", opts: ["גמל 🐪", "סוס 🐴", "ברבור 🦢", "עכבר 🐭"],         ans: "סוס 🐴" },
  { img: "ע", opts: ["פיל 🐘", "עכבר 🐭", "נחש 🐍", "טווס 🦚"],          ans: "עכבר 🐭" },
  { img: "פ", opts: ["פיל 🐘", "זברה 🦓", "דב 🐻", "יונה 🕊️"],           ans: "פיל 🐘" },
  { img: "צ", opts: ["קוף 🐒", "צב 🐢", "חתול 🐱", "אריה 🦁"],           ans: "צב 🐢" },
  { img: "ק", opts: ["סוס 🐴", "ברבור 🦢", "לטאה 🦎", "קוף 🐒"],         ans: "קוף 🐒" },
  { img: "ר", opts: ["תוכי 🦜", "ריינוסרוס 🦏", "גמל 🐪", "כלב 🐶"],     ans: "ריינוסרוס 🦏" },
  { img: "ש", opts: ["עכבר 🐭", "שועל 🦊", "פיל 🐘", "צב 🐢"],           ans: "שועל 🦊" },
  { img: "ת", opts: ["שועל 🦊", "תוכי 🦜", "דב 🐻", "נחש 🐍"],           ans: "תוכי 🦜" },
];

export const HebLabel = { player: 'שחקן' };