export const AVATARS = [
  "🦁", "🐯", "🐺", "🦊", "🐸", "🐧", "🦅", "🐠", "🦄", "🐲", "🤖", "👽",
];

export const PCOLORS = ["#ff6b35", "#00c9a7", "#ff4d8d", "#4d9fff"];

export const SNAKES = { 99: 21, 87: 24, 62: 19, 54: 34, 46: 5, 92: 73, 75: 32 };

export const LADDERS = { 4: 56, 13: 76, 20: 38, 28: 84, 40: 59, 51: 67, 63: 81, 71: 91 };

export const DIE_FACES = ["⚀", "⚁", "⚂", "⚃", "⚄", "⚅"];

export const TRIVIA = [
  { img: "א", opts: ["🐶", "🦁", "🐴", "🐘"], ans: "🦁" },
  { img: "ב", opts: ["🦢", "🐱", "🐍", "🐭"], ans: "🦢" },
  { img: "ג", opts: ["🦁", "🐪", "🦚", "🦜"], ans: "🐪" },
  { img: "ד", opts: ["🐒", "🕊️", "🐻", "🦓"], ans: "🐻" },
  { img: "ה", opts: ["🐪", "🦛", "🦎", "🐢"], ans: "🦛" },
  { img: "ז", opts: ["🐘", "🦓", "🐱", "🦢"], ans: "🦓" },
  { img: "ח", opts: ["🐻", "🐱", "🐍", "🐒"], ans: "🐱" },
  { img: "ט", opts: ["🦚", "🦁", "🐴", "🐪"], ans: "🦚" },
  { img: "י", opts: ["🦢", "🕊️", "🐭", "🐶"], ans: "🕊️" },
  { img: "כ", opts: ["🐘", "🐶", "🦜", "🦓"], ans: "🐶" },
  { img: "ל", opts: ["🐱", "🦎", "🐻", "🦚"], ans: "🦎" },
  { img: "נ", opts: ["🦁", "🐶", "🦎", "🐍"], ans: "🐍" },
  { img: "ס", opts: ["🐪", "🐴", "🦢", "🐭"], ans: "🐴" },
  { img: "ע", opts: ["🐘", "🐭", "🐍", "🦚"], ans: "🐭" },
  { img: "פ", opts: ["🐘", "🦓", "🐻", "🕊️"], ans: "🐘" },
  { img: "צ", opts: ["🐒", "🐢", "🐱", "🦁"], ans: "🐢" },
  { img: "ק", opts: ["🐴", "🦢", "🦎", "🐒"], ans: "🐒" },
  { img: "ר", opts: ["🦜", "🦌", "🐪", "🐶"], ans: "🦌" },
  { img: "ש", opts: ["🐭", "🦊", "🐘", "🐢"], ans: "🦊" },
  { img: "ת", opts: ["🦊", "🦜", "🐻", "🐍"], ans: "🦜" },
];

export const HebLabel = { player: 'שחקן' };