export const AVATARS = [
  "🦁", "🐯", "🐺", "🦊", "🐸", "🐧", "🦅", "🐠", "🦄", "🐲", "🤖", "👽",
];

export const PCOLORS = ["#ff6b35", "#00c9a7", "#ff4d8d", "#4d9fff"];

export const SNAKES = { 99: 21, 87: 24, 62: 19, 54: 34, 46: 5, 92: 73, 75: 32 };

export const LADDERS = { 4: 56, 13: 76, 20: 38, 28: 84, 40: 59, 51: 67, 63: 81, 71: 91 };

export const DIE_FACES = ["⚀", "⚁", "⚂", "⚃", "⚄", "⚅"];

export const TRIVIA = [
  { img: "🦁", name: "אריה",    opts: ["א", "ב", "ג", "ד"], ans: "א" },
  { img: "🍌", name: "בננה",    opts: ["א", "ב", "ג", "ד"], ans: "ב" },
  { img: "🐪", name: "גמל",     opts: ["ב", "ג", "ד", "ה"], ans: "ג" },
  { img: "🚪", name: "דלת",     opts: ["ג", "ד", "ה", "ו"], ans: "ד" },
  { img: "🛞", name: "הגה",     opts: ["ד", "ה", "ו", "ז"], ans: "ה" },
  { img: "🎭", name: "וילון",   opts: ["ה", "ו", "ז", "ח"], ans: "ו" },
  { img: "🐑", name: "כבשה",    opts: ["ה", "כ", "ז", "ח"], ans: "כ" },
  { img: "🫒", name: "זית",     opts: ["ו", "ז", "ח", "ט"], ans: "ז" },
  { img: "🐱", name: "חתול",    opts: ["ז", "ח", "ט", "י"], ans: "ח" },
  { img: "🦚", name: "טווס",    opts: ["ח", "ט", "י", "כ"], ans: "ט" },
  { img: "👦", name: "ילד",     opts: ["ט", "י", "כ", "ל"], ans: "י" },
  { img: "⚽", name: "כדור",    opts: ["י", "כ", "ל", "מ"], ans: "כ" },
  { img: "🍋", name: "לימון",  opts: ["כ", "ל", "מ", "נ"], ans: "ל" },
  { img: "✈️", name: "מטוס",   opts: ["ל", "מ", "נ", "ס"], ans: "מ" },
  { img: "🐆", name: "נמר",     opts: ["מ", "נ", "ס", "ע"], ans: "נ" },
  { img: "🐴", name: "סוס",     opts: ["נ", "ס", "ע", "פ"], ans: "ס" },
  { img: "👁️", name: "עין",    opts: ["ס", "ע", "פ", "צ"], ans: "ע" },
  { img: "🦋", name: "פרפר",    opts: ["ע", "פ", "צ", "ק"], ans: "פ" },
  { img: "🐢", name: "צב",      opts: ["פ", "צ", "ק", "ר"], ans: "צ" },
  { img: "🫖", name: "קומקום", opts: ["צ", "ק", "ר", "ש"], ans: "ק" },
  { img: "🚂", name: "רכבת",    opts: ["ק", "ר", "ש", "ת"], ans: "ר" },
  { img: "⏰", name: "שעון",    opts: ["ר", "ש", "ת", "א"], ans: "ש" },
  { img: "🍎", name: "תפוח",    opts: ["ש", "ת", "א", "ב"], ans: "ת" },
];

export const HebLabel = {
  player:'שחקן',
}